Autodesk.Revit.DB.SpatialElementTag.Name
The name associated with the tag.
Remarks: This overrides Element.Name to allow the API to prevent modifications to the tag's name
(because this is not permitted to be modified in the Autodesk Revit UI).
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when attempting to set
this property, as the name of the tag may not be changed.

Autodesk.Revit.DB.SpatialElementTag.LeaderElbow
The position of the leader's elbow (middle point).
leaderElbow: Sets the elbow point of the tag leader.
Returns: Returns the elbow point of the tag leader.
Since: 2017

Autodesk.Revit.DB.SpatialElementTag.LeaderEnd
The position of the leader's end.
leaderEnd: Sets the end of the tag leader.
Returns: Returns the end point of the tag leader.
Remarks: Leader end point should be located inside of a room, an area or a MEP space.
Since: 2017

Autodesk.Revit.DB.SpatialElementTag.TagHeadPosition
The position of the tag's head.
tagHeadPosition: Sets the head point of the tag.
Returns: Returns the head point of the tag.
Remarks: If the tag has no leader the head position should be located inside a room, an area or a MEP space.
Since: 2017

Autodesk.Revit.DB.SpatialElementTag.TagOrientation
The orientation of the tag.
orientation: Sets the orientation of the tag.
Returns: Returns the orientation of the tag.
Since: 2017

Autodesk.Revit.DB.SpatialElementTag.HasLeader
Identifies if a leader is displayed for the tag or not.
True if a leader is displayed, otherwise false.
Since: 2017

Autodesk.Revit.DB.SpatialElementTag.IsTaggingLink
Identifies if the tag has reference to an object in a linked document or not.
Returns: True if a tag is associated with an object in a linked Revit file, otherwise false.
Since: 2017

Autodesk.Revit.DB.SpatialElementTag.IsOrphaned
Identifies if the tag is orphaned or not.
Remarks: Orphans are those tags that are associated with an instance of a linked Revit file but have no host element.
Tags become orphaned when the element they were tagging was deleted from the link.
Since: 2017

Autodesk.Revit.DB.SpatialElementTag.SpatialElementTagType
The tag type.

Autodesk.Revit.DB.SpatialElementTag.SpatialElement
The element that the tag is associated with.

Autodesk.Revit.DB.SpatialElementTag
A tag attached to an SpatialElement (room, space or area) in Autodesk Revit.